InformationRegisters/СловарьИсключенийДляПроверкиОрфографии_ат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<InformationRegister>
		<Properties>
			<Name>СловарьИсключенийДляПроверкиОрфографии_ат</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Добавивший</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаДобавления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Слово</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СловарьИсключенийДляПроверкиОрфографии_ат/Ext/RecordSetModule.bsl
Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда 
		Возврат;
	КонецЕсли;
	
	//Для начала проверим наличие прав на редактирование данного слова.
	РСС = РегистрыСведений.СловарьИсключенийДляПроверкиОрфографии_ат.СоздатьНаборЗаписей();
	РСС.Отбор.Слово.Значение = ЭтотОбъект.ЭтотОбъект.Отбор.Слово.Значение;
	РСС.Отбор.Слово.Использование = Истина;
	РСС.Прочитать();
	
	ТекущийПользователь = Системный_Сервер_Переопределяемый_ат.ТекущийПользователь();
	
	//Если дошли сюда, значит нам хватает прав.
	Если НЕ РСС.Количество() = 0 Тогда Возврат; КонецЕсли;
	
	//Если элемент новый, проставим сразу добавившего и дату добавления.
	Для Каждого Запись ИЗ ЭтотОбъект Цикл
		//Сначала проверим слово на неправильные символы.
		МассивНайденных = РегулярныеВыражения_КлиентСервер_ат.НайтиПоШаблону(Запись.Слово, "[^a-zA-Zа-яА-ЯёЁ]");
		Если МассивНайденных.Количество() > 0 Тогда
			//Значит нам суют не слово, а охинею.
			Отказ = Истина;
			Возврат;
		КонецЕсли;
		Запись.Добавивший = ТекущийПользователь;
		Запись.ДатаДобавления = ТекущаяДатаСеанса();
	КонецЦикла;
	
КонецПроцедуры
